/***************************************************************************//**
 *  @file 
 *  @brief [信号节点类，存储了信号节点的相关信息]
 * 
 *  <b>文件名</b>      : ThreadEvent.h
 *  @n@n<b>版权所有</b>: 网龙天晴程序部应用软件开发组
 *  @n@n<b>作  者</b>  : alzq
 *  @n@n<b>创建时间</b>: 09-2-6 9:55:12
 *  @n@n<b>文件描述</b>: 
 *  @version  版本        修改者        时间        描述@n
 *  @n        [版本号]    alzq          2009-02-06  [描述]
 * 
*******************************************************************************/
#ifndef __THREAD_EVENT__
#define __THREAD_EVENT__

#include "ThreadHeader.h"
#include "DealSectionControl.h"

#pragma once

class ThreadEvent
{
	friend class ThreadInfo;
	friend class ThreadTreeControl;

public:
	ThreadEvent(BOOL autoReSet, BOOL initState, const CTCHAR * name);
	~ThreadEvent(void);

/**
 *
 *	-------------成员变量声明区
 *
 **/
protected:
	THREADLIST			_m_tlWaitThreadList;				//等待本锁的线程节点地址队列

	int					_m_iSourceCount;					//信号量的剩余资源数统计（大于0为可获取状态
	int					_m_iInitSourceCount;				//初始化的资源数量

	CTCHAR *			_m_csEventName;						//锁的名称

	BOOL				_m_bAutoReset;						//是否自动改变状态的信号量

private:
	DWORD				_m_dwTreeID;						//此锁在树型结构中的编号

	DealSectionControl * _m_csDealLock;						//操作对象的临界区域

/**
 *
 *	-------------公共函数声明区
 *
 **/
public:

/**
 *
 *	-------------保护类函数声明区
 *
 **/
protected:
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [获取信号量是否为有信号状态]
	 * @n<b>函数名称</b>: _GetEventSingleEnable
	 * @return            [返回值描述]
	 * @see               [参见函数]
	 * @n<b>作者</b>    :alzq
	 * @n<b>创建时间</b>: 09-2-6 16:10:36
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	BOOL _GetEventSingleEnable(void);
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [线程尝试获取信号，返回是否获取成功]
	 * @n<b>函数名称</b>        : _ThreadTryGetEvent
	 * @n@param LPVOID lpThread : [线程节点地址]
	 * @return                    [返回值描述]
	 * @see                       [参见函数]
	 * @n<b>作者</b>            :alzq
	 * @n<b>创建时间</b>        : 09-2-6 16:25:34
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	BOOL _ThreadTryGetEvent(LPVOID lpThread);
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [在本信号量的等待线程队列中添加线程节点地址]
	 * @n<b>函数名称</b>        : _AddWaitingThread
	 * @n@param LPVOID lpThread : [参数描述]
	 * @see                       [参见函数]
	 * @n<b>作者</b>            :alzq
	 * @n<b>创建时间</b>        : 09-2-6 16:38:40
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	void _AddWaitingThread(LPVOID lpThread);
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [释放信号量（将信号量中资源统计加1）]
	 * @n<b>函数名称</b>        : _ReleaseEvent
	 * @return                    [返回是否释放成功，当线程不拥有控制权时则释放不成功]
	 * @see                       [参见函数]
	 * @n<b>作者</b>            :alzq
	 * @n<b>创建时间</b>        : 09-2-6 17:02:22
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	BOOL _ReleaseEvent(void);
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [获取下一个在等待该锁的线程节点地址]
	 * @n<b>函数名称</b>: _GetFirstWaitingThread
	 * @return            [返回值描述]
	 * @see               [参见函数]
	 * @n<b>作者</b>    :alzq
	 * @n<b>创建时间</b>: 09-2-6 17:08:54
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	LPVOID _GetFirstWaitingThread(void);
	/*******************************************************************************************************
	 * @brief [函数简要描述]
	 * 
	 * [将等待线程节点从本锁的等待线程队列中删除]
	 * @n<b>函数名称</b>        : _DelWaitingThread
	 * @n@param LPVOID lpThread : [参数描述]
	 * @see                       [参见函数]
	 * @n<b>作者</b>            :alzq
	 * @n<b>创建时间</b>        : 09-2-6 17:11:19
	 * @version    修改者        时间        描述@n
	 * @n          alzq          2009-02-06  [描述]
	 ******************************************************************************************************/
	void _DelWaitingThread(LPVOID lpThread);

};

#endif
