/*
 *  itunesInterface.h
 *
 *  Created by lindaojiang on 2012-6-8
 *  Copyright 2012 NetDragon Websoft Inc. All rights reserved.
 *
 */

#ifndef _ITUNES_DLL_INTERFACE_H_
#define _ITUNES_DLL_INTERFACE_H_

#include <windows.h>
#include <tchar.h>

#ifdef __cplusplus
extern "C" {
#endif

// 参考 MobileDevice.h  http://theiphonewiki.com/wiki/index.php?title=MobileDevice_Library
//	https://bitbucket.org/tristero/mobiledeviceaccess/src
//	http://code.google.com/p/iphonetunnel-usbmuxconnectbyport/source/browse/

#pragma pack(push, 1)

//========================CoreFoundation===========================================

#if !defined(__MACTYPES__)
#if !defined(_OS_OSTYPES_H)
typedef unsigned char           Boolean;
typedef unsigned char           UInt8;
typedef signed char             SInt8;
typedef unsigned short          UInt16;
typedef signed short            SInt16;
typedef unsigned int            UInt32;
typedef signed int              SInt32;
typedef UINT64		    UInt64;
typedef INT64		    SInt64;
typedef SInt32                  OSStatus;
#endif
typedef float                   Float32;
typedef double                  Float64;
typedef unsigned short          UniChar;
typedef unsigned long           UniCharCount;
typedef unsigned char *         StringPtr;
typedef const unsigned char *   ConstStringPtr;
typedef unsigned char           Str255[256];
typedef const unsigned char *   ConstStr255Param;
typedef SInt16                  OSErr;
typedef SInt16                  RegionCode;
typedef SInt16                  LangCode;
typedef SInt16                  ScriptCode;
typedef UInt32                  FourCharCode;
typedef FourCharCode            OSType;
typedef UInt8                   Byte;
typedef SInt8                   SignedByte;
#endif
#if !defined(__MACTYPES__) || (defined(UNIVERSAL_INTERFACES_VERSION) && UNIVERSAL_INTERFACES_VERSION < 0x0340)
typedef UInt32                  UTF32Char;
typedef UInt16                  UTF16Char;
typedef UInt8                   UTF8Char;
#endif

typedef unsigned long CFTypeID;
typedef unsigned long CFOptionFlags;
typedef unsigned long CFHashCode;
typedef signed long CFIndex;
typedef void * CFTypeRef;
typedef CFTypeRef CFPropertyListRef;
typedef CFTypeRef CFDictionaryRef;
typedef CFTypeRef CFMutableDictionaryRef;
typedef CFTypeRef CFDataRef;
typedef CFTypeRef CFStringRef;
typedef CFTypeRef CFMutableStringRef;
typedef CFTypeRef CFArrayRef;
typedef CFTypeRef CFMutableArrayRef;
typedef CFTypeRef CFAllocatorRef;
typedef CFTypeRef CFReadStreamRef;
typedef CFTypeRef CFWriteStreamRef;
typedef CFTypeRef CFNumberRef;
typedef CFTypeRef CFBooleanRef;

typedef struct CFRange {
	CFIndex location;
	CFIndex length;
}CFRange;

/* Values returned from comparison functions */
enum {
	kCFCompareLessThan = -1,
	kCFCompareEqualTo = 0,
	kCFCompareGreaterThan = 1
};
typedef CFIndex CFComparisonResult;

/* Platform-independent built-in encodings; always available on all platforms.
   Call CFStringGetSystemEncoding() to get the default system encoding.
*/
typedef UINT32 CFStringEncoding;
#define kCFStringEncodingInvalidId (0xffffffffU)
enum {
    kCFStringEncodingMacRoman = 0,
    kCFStringEncodingWindowsLatin1 = 0x0500, /* ANSI codepage 1252 */
    kCFStringEncodingISOLatin1 = 0x0201, /* ISO 8859-1 */
    kCFStringEncodingNextStepLatin = 0x0B01, /* NextStep encoding*/
    kCFStringEncodingASCII = 0x0600, /* 0..127 (in creating CFString, values greater than 0x7F are treated as corresponding Unicode value) */
    kCFStringEncodingUnicode = 0x0100, /* kTextEncodingUnicodeDefault  + kTextEncodingDefaultFormat (aka kUnicode16BitFormat) */
    kCFStringEncodingUTF8 = 0x08000100, /* kTextEncodingUnicodeDefault + kUnicodeUTF8Format */
    kCFStringEncodingNonLossyASCII = 0x0BFF, /* 7bit Unicode variants used by Cocoa & Java */

    kCFStringEncodingUTF16 = 0x0100, /* kTextEncodingUnicodeDefault + kUnicodeUTF16Format (alias of kCFStringEncodingUnicode) */
    kCFStringEncodingUTF16BE = 0x10000100, /* kTextEncodingUnicodeDefault + kUnicodeUTF16BEFormat */
    kCFStringEncodingUTF16LE = 0x14000100, /* kTextEncodingUnicodeDefault + kUnicodeUTF16LEFormat */

    kCFStringEncodingUTF32 = 0x0c000100, /* kTextEncodingUnicodeDefault + kUnicodeUTF32Format */
    kCFStringEncodingUTF32BE = 0x18000100, /* kTextEncodingUnicodeDefault + kUnicodeUTF32BEFormat */
    kCFStringEncodingUTF32LE = 0x1c000100 /* kTextEncodingUnicodeDefault + kUnicodeUTF32LEFormat */
};
typedef CFStringEncoding CFStringBuiltInEncodings;

enum {	
	//default 0, 区分大小写
	kCFCompareCaseInsensitive = 1,	//不区分大小写
	kCFCompareBackwards = 4,		/* Starting from the end of the string */
	kCFCompareAnchored = 8,		/* Only at the specified starting point */
	kCFCompareNonliteral = 16,		/* If specified, loose equivalence is performed (o-umlaut == o, umlaut) */
	kCFCompareLocalized = 32,		/* User's default locale is used for the comparisons */
	kCFCompareNumerically = 64		/* Numeric comparison is used; that is, Foo2.txt < Foo7.txt < Foo25.txt */
};
typedef CFOptionFlags CFStringCompareFlags;


typedef const void *(*CFDictionaryRetainCallBack)(CFAllocatorRef allocator, const void *value);
typedef void		(*CFDictionaryReleaseCallBack)(CFAllocatorRef allocator, const void *value);
typedef CFStringRef	(*CFDictionaryCopyDescriptionCallBack)(const void *value);
typedef bool		(*CFDictionaryEqualCallBack)(const void *value1, const void *value2);
typedef CFHashCode	(*CFDictionaryHashCallBack)(const void *value);
typedef struct {
	CFIndex				version;
	CFDictionaryRetainCallBack		retain;
	CFDictionaryReleaseCallBack		release;
	CFDictionaryCopyDescriptionCallBack	copyDescription;
	CFDictionaryEqualCallBack		equal;
	CFDictionaryHashCallBack		hash;
} CFDictionaryKeyCallBacks;

typedef struct {
	CFIndex				version;
	CFDictionaryRetainCallBack		retain;
	CFDictionaryReleaseCallBack		release;
	CFDictionaryCopyDescriptionCallBack	copyDescription;
	CFDictionaryEqualCallBack		equal;
} CFDictionaryValueCallBacks;

enum {
	kCFPropertyListImmutable = 0,
	kCFPropertyListMutableContainers,
	kCFPropertyListMutableContainersAndLeaves
};
typedef CFOptionFlags CFPropertyListMutabilityOptions;

enum {
	kCFPropertyListOpenStepFormat = 1,
	kCFPropertyListXMLFormat_v1_0 = 100,
	kCFPropertyListBinaryFormat_v1_0 = 200
};
typedef CFIndex CFPropertyListFormat;

enum {
	/* Fixed-width types */
	kCFNumberSInt8Type = 1,
	kCFNumberSInt16Type = 2,
	kCFNumberSInt32Type = 3,
	kCFNumberSInt64Type = 4,
	kCFNumberFloat32Type = 5,
	kCFNumberFloat64Type = 6,	/* 64-bit IEEE 754 */
	/* Basic C types */
	kCFNumberCharType = 7,
	kCFNumberShortType = 8,
	kCFNumberIntType = 9,
	kCFNumberLongType = 10,
	kCFNumberLongLongType = 11,
	kCFNumberFloatType = 12,
	kCFNumberDoubleType = 13,
	/* Other */
	kCFNumberCFIndexType = 14,
	kCFNumberNSIntegerType = 15,
	kCFNumberCGFloatType = 16,
	kCFNumberMaxType = 16
};
typedef CFIndex CFNumberType;

//========================CoreFoundation===========================================

typedef void * _UNKNOWN;

typedef unsigned int afc_error_t;
typedef unsigned int usbmux_error_t;

/* mode 2 = read, mode 3 = write; unknown = 0 */ /* 1=read, 2=write, 3=read/write */
#define AFC_FILEMODE_READ			2
#define AFC_FILEMODE_WRITE			3

struct am_recovery_device;

struct am_device_notification_callback_info {
    struct am_device *dev;  /* 0    device */ 
    unsigned int msg;       /* 4    one of ADNCI_MSG_* */
};

/* The type of the device restore notification callback functions.
 * TODO: change to correct type. */
typedef void (*am_restore_device_notification_callback)(struct am_recovery_device *);

/* This is a CoreFoundation object of class AMRecoveryModeDevice. */
struct am_recovery_device {
    unsigned char unknown0[8];                          /* 0 */
    am_restore_device_notification_callback callback;   /* 8 */
    void *user_info;                                    /* 12 */
    unsigned char unknown1[12];                         /* 16 */
    unsigned int readwrite_pipe;                        /* 28 */
    unsigned char read_pipe;                            /* 32 */
    unsigned char write_ctrl_pipe;                      /* 33 */
    unsigned char read_unknown_pipe;                    /* 34 */
    unsigned char write_file_pipe;                      /* 35 */
    unsigned char write_input_pipe;                     /* 36 */
};

/* A CoreFoundation object of class AMRestoreModeDevice. */
struct am_restore_device {
    unsigned char unknown[32];
    int port;
};

/* The type of the device notification callback function. */
typedef void(*am_device_notification_callback)(struct am_device_notification_callback_info *);

/* The type of the _AMDDeviceAttached function.
 * TODO: change to correct type. */
typedef void *amd_device_attached_callback;

/* The type of the device restore notification callback functions.
 * TODO: change to correct type. */
typedef void (*am_restore_device_notification_callback)(struct am_recovery_device *);
 
struct am_device {			
    unsigned char unknown0[16]; /* 0 - zero */
    unsigned int device_id;     /* 16 */
    unsigned int product_id;    /* 20 - set to AMD_IPHONE_PRODUCT_ID */
    char *serial;               /* 24 - set to AMD_IPHONE_SERIAL */
    unsigned int unknown1;      /* 28 */
    unsigned char unknown2[4];  /* 32 */
    unsigned int lockdown_conn; /* 36 */
    unsigned char unknown3[8];  /* 40 */
	unsigned int unknown4;      /* 48 - used to store CriticalSection Handle*/
	unsigned char unknown5[24];  /* 52 */
};


struct am_device_notification {
    unsigned int unknown0;                      /* 0 */
    unsigned int unknown1;                      /* 4 */
    unsigned int unknown2;                      /* 8 */
    am_device_notification_callback callback;   /* 12 */ 
    unsigned int unknown3;                      /* 16 */
};

struct afc_connection {
    unsigned int handle;            /* 0 */
    unsigned int unknown0;          /* 4 */
    unsigned char unknown1;         /* 8 */
    unsigned char padding[3];       /* 9 */
    unsigned int unknown2;          /* 12 */
    unsigned int unknown3;          /* 16 */
    unsigned int unknown4;          /* 20 */
    unsigned int fs_block_size;     /* 24 */
    unsigned int sock_block_size;   /* 28: always 0x3c */
    unsigned int io_timeout;        /* 32: from AFCConnectionOpen, usu. 0 */
    void *afc_lock;                 /* 36 */
    unsigned int context;           /* 40 */
};

struct afc_device_info {
    unsigned char unknown[12];  /* 0 */
};

struct afc_directory {
    unsigned char unknown[1];   /* size unknown */
};

struct afc_dictionary {
    unsigned char unknown[1];   /* size unknown */
};

typedef unsigned long long afc_file_ref;

struct usbmux_listener_1 {                  /* offset   value in iTunes */
    unsigned int unknown0;                  /* 0        1 */
    unsigned char *unknown1;                /* 4        ptr, maybe device? */
    amd_device_attached_callback callback;  /* 8        _AMDDeviceAttached */
    unsigned int unknown3;                  /* 12 */
    unsigned int unknown4;                  /* 16 */
    unsigned int unknown5;                  /* 20 */
};

struct usbmux_listener_2 {
    unsigned char unknown0[4144];
};

struct am_bootloader_control_packet {
    unsigned char opcode;       /* 0 */
    unsigned char length;       /* 1 */
    unsigned char magic[2];     /* 2: 0x34, 0x12 */
    //unsigned char payload[0];   /* 4 */
};




//------------------------------------------------------------

typedef int (*PF_AMDeviceNotificationSubscribe)(
	am_device_notification_callback callback, 
	unsigned int unused0, 
	unsigned int unused1, 
	unsigned int dn_unknown3, 
	struct am_device_notification **notification
);

typedef int (*PF_AMDeviceGetConnectionID)(struct am_device *device);
typedef int (*PF_AMDeviceCopyDeviceIdentifier)(struct am_device *device);
typedef CFTypeRef (*PF_AMDeviceCopyValue)(struct am_device *device, CFStringRef domain, CFStringRef key);

typedef int (*PF_AMDeviceConnect)(struct am_device *device);

typedef int (*PF_AMDeviceIsPaired)(struct am_device *device);
