/**************************************************************************/
/*                                                                        */
/* Copyright (c) 1999-2011 NetDragon Websoft Inc.                         */
/*                    网龙网络有限公司版权所有 1999-2011                  */
/*                                                                        */
/*  PROPRIETARY RIGHTS of NetDragon Websoft Inc. are involved in the      */
/*  subject matter of this material. All manufacturing, reproduction,     */
/*  use, and sales rights pertaining to this subject matter are governed  */
/*  by the license agreement.  The recipient of this software implicitly  */ 
/*  accepts the terms of the license.                                     */
/*  本软件文档资料是网龙网络有限公司版权所有的合法资产，任何人士阅读和使  */
/*  用本资料必须获得相应的书面授权,承担保密责任和接受相应的法律约束。     */
/*                                                                        */
/**************************************************************************/

#include "utils.h"
#ifdef WIN32
	#include <Windows.h>
#else
	#include "Common/winPort.h"
	#include <stdlib.h>
#endif
//#################################################################################################
//##################################### 内部函数开始 ##############################################
//#################################################################################################

//#################################################################################################
//##################################### 内部函数结束 ##############################################
//#################################################################################################

//#################################################################################################
//##################################### 外部接口开始 ##############################################
//#################################################################################################

//产生一个64bitID
ND_UINT64 ND_GenerateID64( void )
{
	srand( GetTickCount() );
	return (((ND_UINT64)(rand()&0xffff))<<48)+(((ND_UINT64)(rand()&0xffff))<<32)+(((ND_UINT64)(rand()&0xffff))<<16)+((ND_UINT64)(rand()&0xffff));
}

//转化为MAC时间
ND_UINT32 ND_TimeConv( ND_UINT64 iTimeData )
{
	if( iTimeData != 0 )
		return (ND_UINT32)( iTimeData - 978307200 );
    else
		return (ND_UINT32)iTimeData;
}

//#################################################################################################
//##################################### 外部接口结束 ##############################################
//#################################################################################################
